Icomi1/01.project/01.02视觉巡线小车/code/STM32F1/202121093126祁舰锋视觉巡线小车/Hardware/usart.c
//#include "sys.h"
#include "usart.h"    
#include "stm32f10x.h"                  // Device header
//////////////////////////////////////////////////////////////////////////////////     
//如果使用ucos,则包括下面的头文件即可.
#if SYSTEM_SUPPORT_UCOS
#include "includes.h"               //ucos 使用     
#endif
     
 

//////////////////////////////////////////////////////////////////
//加入以下代码,支持printf函数,而不需要选择use MicroLIB     
#if 1
#pragma import(__use_no_semihosting)             
//标准库需要的支持函数                 
struct __FILE 
{ 
   int handle; 

}; 

FILE __stdout;
//定义_sys_exit()以避免使用半主机模式    
void _sys_exit(int x) 
{ 
   x = x; 
} 
//重定义fputc函数 
int fputc(int ch, FILE *f)
{      
   while((USART2->SR&0X40)==0);//循环发送,直到发送完毕   
    USART2->DR = (u8) ch;      
   return ch;
}
#endif 

/*使用microLib的方法*/
 /* 
int fputc(int ch, FILE *f)
{
   USART_SendData(USART1, (uint8_t) ch);

   while (USART_GetFlagStatus(USART1, USART_FLAG_TC) == RESET) {}   
   
    return ch;
}
int GetKey (void)  { 

    while (!(USART1->SR & USART_FLAG_RXNE));

    return ((int)(USART1->DR & 0x1FF));
}
*/
 
#if EN_USART2_RX   //如果使能了接收
//串口1中断服务程序
//注意,读取USARTx->SR能避免莫名其妙的错误      
u8 USART_RX_BUF[USART_REC_LEN];     //接收缓冲,最大USART_REC_LEN个字节.
//接收状态
//bit15，   接收完成标志
//bit14，   接收到0x0d
//bit13~0，   接收到的有效字节数目
u16 USART_RX_STA=0;       //接收状态标记     
  
void uart_init(u32 bound){
    //GPIO端口设置
    GPIO_InitTypeDef GPIO_InitStructure;
   USART_InitTypeDef USART_InitStructure;
   NVIC_InitTypeDef NVIC_InitStructure;
    
   RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA|RCC_APB2Periph_AFIO, ENABLE);   //使能USART1，GPIOA时钟以及复用功能时钟
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2,ENABLE);
     //USART2_TX   PA.2
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2; //PA.9
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;   //复用推挽输出
    GPIO_Init(GPIOA, &GPIO_InitStructure);
   
    //USART2_RX     PA.3
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;//浮空输入
    GPIO_Init(GPIOA, &GPIO_InitStructure);  

   //Usart1 NVIC 配置

    NVIC_InitStructure.NVIC_IRQChannel = USART2_IRQn;
   NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority=3 ;//抢占优先级3
   NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;      //子优先级3
   NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;         //IRQ通道使能
   NVIC_Init(&NVIC_InitStructure);   //根据指定的参数初始化VIC寄存器
  
   //USART 初始化设置

   USART_InitStructure.USART_BaudRate = bound;//一般设置为9600;
   USART_InitStructure.USART_WordLength = USART_WordLength_8b;//字长为8位数据格式
   USART_InitStructure.USART_StopBits = USART_StopBits_1;//一个停止位
   USART_InitStructure.USART_Parity = USART_Parity_No;//无奇偶校验位
   USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;//无硬件数据流控制
   USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;   //收发模式

    USART_Init(USART2, &USART_InitStructure); //初始化串口
    USART_ITConfig(USART2, USART_IT_RXNE, ENABLE);//开启中断
    USART_Cmd(USART2, ENABLE);                    //使能串口 

}

uint8_t Serial_RxPacket[100] = {0,0,0};
uint8_t Serial_RxFlag;
void USART2_IRQHandler(void)                   //串口1中断服务程序
{
   static uint8_t RxState = 0;
   static uint8_t pRxPacket = 0;
   
   if(USART_GetITStatus(USART2, USART_IT_RXNE) != RESET) 
   {
      uint8_t RxData = USART_ReceiveData(USART2); 
      
      if(RxState == 0)
      {
         if(RxData == 0x2C)          
         {
            
            RxState = 1;
         }
      }
      else if(RxState == 1)
      {
         if(RxData == 0x12)          
         {
            RxState = 2;
            
            if(pRxPacket > 100)
            {
               pRxPacket = 0;
            }
            
         }
      }
      else if(RxState == 2)
      {
         Serial_RxPacket[pRxPacket] = RxData;
         pRxPacket++;
         if(pRxPacket >= 3)
         {
            
            RxState = 3;
            pRxPacket = 0;
            
         }
      }
      else if(RxState == 3)
      {
         if(RxData == 0x5B)
         {
            RxState = 0;
            Serial_RxFlag = 1;
         }
      }
      
   }
   USART_ClearITPendingBit(USART2, USART_IT_RXNE);
} 

void GetVisionMotor(uint16_t* left, uint16_t* right)
{
    *left = ((int8_t)Serial_RxPacket[0] + 80) * 35;
    *right = ((int8_t)Serial_RxPacket[1] + 80) * 35;
    //printf("%d, %d\r\n",*left,*right);
}

void GetVisionDuoji(uint16_t* duoji)
{
    uint16_t temp1=0;
    temp1 = (int8_t)Serial_RxPacket[0] + 80;
    if(temp1<40) *duoji = 500;
    else if(temp1>120) *duoji = 2500;
    else *duoji = (temp1*25) - 500;
}

uint8_t GetVisionFlag(void)
{
    return (Serial_RxPacket[2]);
}   

#endif   

